public/ethernetequipment_EthernetPortSpecifics.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP:Header>
      <header xmlns="xmlapi_1.0">
         <security>
            <user>C12285</user>
            <password hashed="false">Peru2018#</password>
         </security>
         <requestID>aquiroga:0001</requestID>
      </header>
   </SOAP:Header>

   <SOAP:Body>
      <find xmlns="xmlapi_1.0">
         <fullClassName>ethernetequipment.EthernetPortSpecifics</fullClassName>
         <filter>
           <and>
             <notEqual name="portClass" value="tdm"/>
             <notEqual name="portClass" value="sonet"/>
             <notEqual name="portClass" value="none"/>
           </and>
         </filter>
         <resultFilter>
            <attribute>siteName</attribute>
            <attribute>displayedName</attribute>
            <attribute>egressRate</attribute>
            <attribute>portClass</attribute>
            <children/>
         </resultFilter>
      </find>
   </SOAP:Body>

</SOAP:Envelope>
